ZigaMahne/STM32U5xx_DFP/CMSIS/SVD/STM32U5G7.svd
        <register>
          <name>TZSC_MPCWM5AR</name>
          <displayName>TZSC_MPCWM5AR</displayName>
          <description>TZSC memory 5 sub-region A watermark register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUBA_START</name>
              <description>Start of sub-region A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>SUBA_LENGTH</name>
              <description>Length of sub-region A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZSC_MPCWM5BCFGR</name>
          <displayName>TZSC_MPCWM5BCFGR</displayName>
          <description>TZSC memory 5 sub-region B watermark configuration register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SREN</name>
              <description>Sub-region enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK</name>
              <description>Sub-region lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure sub-region</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged sub-region</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZSC_MPCWM5BR</name>
          <displayName>TZSC_MPCWM5BR</displayName>
          <description>TZSC memory 5 sub-region B watermark register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUBB_START</name>
              <description>Start of sub-region A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>SUBB_LENGTH</name>
              <description>Length of sub-region A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZSC_MPCWM6ACFGR</name>
          <displayName>TZSC_MPCWM6ACFGR</displayName>
          <description>TZSC memory 6 sub-region B watermark configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SREN</name>
              <description>Sub-region enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK</name>
              <description>Sub-region lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure sub-region</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged sub-region</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZSC_MPCWM6AR</name>
          <displayName>TZSC_MPCWM6AR</displayName>
          <description>TZSC memory 6 sub-region B watermark register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUBA_START</name>
              <description>Start of sub-region A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>SUBA_LENGTH</name>
              <description>Length of sub-region A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZSC_MPCWM6BCFGR</name>
          <displayName>TZSC_MPCWM6BCFGR</displayName>
          <description>TZSC memory 6 sub-region B watermark configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SREN</name>
              <description>Sub-region enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK</name>
              <description>Sub-region lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure sub-region</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged sub-region</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZSC_MPCWM6BR</name>
          <displayName>TZSC_MPCWM6BR</displayName>
          <description>TZSC memory 6 sub-region B watermark register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUBB_START</name>
              <description>Start of sub-region A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>SUBB_LENGTH</name>
              <description>Length of sub-region A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
