ZigaMahne/STM32U5xx_DFP/CMSIS/SVD/STM32U5G7.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GTZC2_TZIC">
      <name>SEC_GTZC2_TZIC</name>
	  <disableCondition>DCB-&gt;DSCSR-&gt;CDS == 0</disableCondition>
      <baseAddress>0x56023400</baseAddress>
    </peripheral>
    <peripheral>
      <name>GTZC2_TZSC</name>
      <description>GTZC2_TZSC</description>
      <groupName>GTZC</groupName>
      <baseAddress>0x46023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TZSC_CR</name>
          <displayName>TZSC_CR</displayName>
          <description>TZSC control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LCK</name>
              <description>lock the configuration of GTZC1_TZSC_SECCFGRx and GTZC1_TZSC_PRIVCFGRx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZSC_SECCFGR1</name>
          <displayName>TZSC_SECCFGR1</displayName>
          <description>TZSC secure configuration register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI3SEC</name>
              <description>secure access mode for SPI3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1SEC</name>
              <description>secure access mode for LPUART1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3SEC</name>
              <description>secure access mode for I2C3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM1SEC</name>
              <description>secure access mode for LPTIM1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3SEC</name>
              <description>secure access mode for LPTIM3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4SEC</name>
              <description>secure access mode for LPTIM4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMPSEC</name>
              <description>secure access mode for OPAMP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPSEC</name>
              <description>secure access mode for COMP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC2SEC</name>
              <description>secure access mode for ADC2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFBUFSEC</name>
              <description>secure access mode for VREFBUF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC1SEC</name>
              <description>secure access mode for DAC1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1SEC</name>
              <description>secure access mode for ADF1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TZSC_PRIVCFGR1</name>
          <displayName>TZSC_PRIVCFGR1</displayName>
          <description>TZSC privilege configuration register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI3PRIV</name>
              <description>privileged access mode for SPI3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1PRIV</name>
              <description>privileged access mode for LPUART1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3PRIV</name>
              <description>privileged access mode for I2C3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM1PRIV</name>
              <description>privileged access mode for LPTIM1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3PRIV</name>
              <description>privileged access mode for LPTIM3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4PRIV</name>
              <description>privileged access mode for LPTIM4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMPPRIV</name>
              <description>privileged access mode for OPAMP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPPRIV</name>
              <description>privileged access mode for COMP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC2PRIV</name>
              <description>privileged access mode for ADC2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFBUFPRIV</name>
              <description>privileged access mode for VREFBUF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC1PRIV</name>
              <description>privileged access mode for DAC1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1PRIV</name>
              <description>privileged access mode for ADF1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
