ZigaMahne/STM32U5xx_DFP/CMSIS/SVD/STM32U5G7.svd
          <register>
            <name>JPEG_HUFFENC_AC1_11</name>
            <displayName>JPEG_HUFFENC_AC1_11</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_66</alternateRegister>
            <addressOffset>0x608</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE22</name>
                <description>Huffman code 22</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN22</name>
                <description>Huffman length 22</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE23</name>
                <description>Huffman code 23</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN23</name>
                <description>Huffman length 23</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_67</name>
            <displayName>JPEG_HUFFENC_AC0_67</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x60C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE134</name>
                <description>Huffman code 134</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN134</name>
                <description>Huffman length 134</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE135</name>
                <description>Huffman code 135</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN135</name>
                <description>Huffman length 135</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_12</name>
            <displayName>JPEG_HUFFENC_AC1_12</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_67</alternateRegister>
            <addressOffset>0x60C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE24</name>
                <description>Huffman code 24</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN24</name>
                <description>Huffman length 24</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE25</name>
                <description>Huffman code 25</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN25</name>
                <description>Huffman length 25</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_68</name>
            <displayName>JPEG_HUFFENC_AC0_68</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x610</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE136</name>
                <description>Huffman code 136</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN136</name>
                <description>Huffman length 136</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE137</name>
                <description>Huffman code 137</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN137</name>
                <description>Huffman length 137</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_13</name>
            <displayName>JPEG_HUFFENC_AC1_13</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_68</alternateRegister>
            <addressOffset>0x610</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE26</name>
                <description>Huffman code 26</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN26</name>
                <description>Huffman length 26</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE27</name>
                <description>Huffman code 27</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN27</name>
                <description>Huffman length 27</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_69</name>
            <displayName>JPEG_HUFFENC_AC0_69</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x614</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE138</name>
                <description>Huffman code 138</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN138</name>
                <description>Huffman length 138</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE139</name>
                <description>Huffman code 139</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN139</name>
                <description>Huffman length 139</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_14</name>
            <displayName>JPEG_HUFFENC_AC1_14</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_69</alternateRegister>
            <addressOffset>0x614</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE28</name>
                <description>Huffman code 28</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN28</name>
                <description>Huffman length 28</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE29</name>
                <description>Huffman code 29</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN29</name>
                <description>Huffman length 29</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_70</name>
            <displayName>JPEG_HUFFENC_AC0_70</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x618</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE140</name>
                <description>Huffman code 140</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN140</name>
                <description>Huffman length 140</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE141</name>
                <description>Huffman code 141</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN141</name>
                <description>Huffman length 141</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_15</name>
            <displayName>JPEG_HUFFENC_AC1_15</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_70</alternateRegister>
            <addressOffset>0x618</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE30</name>
                <description>Huffman code 30</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN30</name>
                <description>Huffman length 30</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE31</name>
                <description>Huffman code 31</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN31</name>
                <description>Huffman length 31</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_71</name>
            <displayName>JPEG_HUFFENC_AC0_71</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x61C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE142</name>
                <description>Huffman code 142</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN142</name>
                <description>Huffman length 142</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE143</name>
                <description>Huffman code 143</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN143</name>
                <description>Huffman length 143</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_16</name>
            <displayName>JPEG_HUFFENC_AC1_16</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_71</alternateRegister>
            <addressOffset>0x61C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE32</name>
                <description>Huffman code 32</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN32</name>
                <description>Huffman length 32</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE33</name>
                <description>Huffman code 33</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN33</name>
                <description>Huffman length 33</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_72</name>
            <displayName>JPEG_HUFFENC_AC0_72</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x620</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE144</name>
                <description>Huffman code 144</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN144</name>
                <description>Huffman length 144</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE145</name>
                <description>Huffman code 145</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN145</name>
                <description>Huffman length 145</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_17</name>
            <displayName>JPEG_HUFFENC_AC1_17</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_72</alternateRegister>
            <addressOffset>0x620</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE34</name>
                <description>Huffman code 34</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN34</name>
                <description>Huffman length 34</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE35</name>
                <description>Huffman code 35</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN35</name>
                <description>Huffman length 35</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_73</name>
            <displayName>JPEG_HUFFENC_AC0_73</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x624</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE146</name>
                <description>Huffman code 146</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN146</name>
                <description>Huffman length 146</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE147</name>
                <description>Huffman code 147</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN147</name>
                <description>Huffman length 147</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_18</name>
            <displayName>JPEG_HUFFENC_AC1_18</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_73</alternateRegister>
            <addressOffset>0x624</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE36</name>
                <description>Huffman code 36</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN36</name>
                <description>Huffman length 36</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE37</name>
                <description>Huffman code 37</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN37</name>
                <description>Huffman length 37</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
